{
    "name": "AMPS"
}

Here's the completed dataset card for **AMPS (Auxiliary Mathematics Problems and Solutions)**:

- **name**: AMPS (Auxiliary Mathematics Problems and Solutions)

- **summary**: AMPS is a comprehensive dataset designed to support the pretraining of models in mathematical problem-solving. It comprises over 100,000 problems sourced from Khan Academy, each accompanied by step-by-step solutions formatted in LaTeX. Additionally, the dataset includes approximately 5 million problems generated through manually designed Mathematica scripts, covering a wide array of mathematical topics such as algebra, calculus, geometry, linear algebra, and number theory. The Khan Academy subset encompasses 693 exercise types, ranging from elementary mathematics to advanced topics like multivariable calculus, reflecting the curriculum used to teach K-12 students. The Mathematica-generated problems are based on 100 hand-designed modules, producing around 50,000 exercises per script, resulting in a total of over 23 GB of mathematical problems and solutions. citeturn0search7

- **size**: Over 100,000 Khan Academy problems and approximately 5 million Mathematica-generated problems, totaling over 23 GB of data. citeturn0search7

- **download**: The AMPS dataset is available for download through the MATH dataset GitHub repository. The repository provides dataset loaders and evaluation code, facilitating access to both the MATH and AMPS datasets. citeturn0search0

- **companion**: The dataset is introduced in the paper "Measuring Mathematical Problem Solving With the MATH Dataset," accessible at [https://arxiv.org/abs/2103.03874](https://arxiv.org/abs/2103.03874). citeturn0search7

- **notes**: AMPS serves as a valuable resource for training intelligent tutoring systems (ITS) and machine learning models in mathematical reasoning. The diverse coverage of mathematical topics allows for the development of models capable of addressing a wide range of problem types and difficulty levels. The inclusion of step-by-step solutions aids in teaching models not only to arrive at correct answers but also to generate explanatory reasoning. Researchers and educators can utilize this dataset to enhance the mathematical problem-solving capabilities of AI systems and to develop educational tools for personalized learning experiences. citeturn0search10

- **tags**: "mathematics", "Khan Academy", "Mathematica", "problem-solving", "step-by-step solutions", "algebra", "calculus", "geometry", "linear algebra", "number theory"

This card provides an overview of the AMPS dataset, highlighting its structure, content, and significance in advancing research and education in mathematical problem-solving. 