{
    "name": "IMO-Steps",
    "size": "20 samples, 6 kB",
    "download": "https://huggingface.co/datasets/roozbeh-yz/IMO-Steps",
    "companion": "https://arxiv.org/abs/2411.18872",
    "summary": "DOWNLOADED IN `/checkpoint/amaia/explore/datasets/reasoning/raw` 20 Lean proofs of IMO problems"
}

Here's the completed dataset card for **IMO-Steps**:

- **name**: IMO-Steps

- **summary**: IMO-Steps is a meticulously curated dataset comprising formal proofs of International Mathematical Olympiad (IMO) problems, formalized in Lean 4. This collection includes complete, original formal proofs for 14 IMO problems from the miniF2F benchmark that previously lacked formal proofs, along with 3 additional problems from IMO 2022 and 2023. The dataset encompasses approximately 5,880 lines of Lean code, providing a valuable resource for developing and evaluating AI models in automated theorem proving. 

- **size**: Approximately 17 formalized IMO problems, totaling around 5,880 lines of Lean code. 

- **download**: The dataset is available for download at [https://huggingface.co/datasets/roozbeh-yz/IMO-Steps](https://huggingface.co/datasets/roozbeh-yz/IMO-Steps). 

- **companion**: The dataset is introduced in the paper "A Lean Dataset for International Math Olympiad: Small Steps towards Writing Math Proofs for Hard Problems," accessible at [https://arxiv.org/abs/2411.18872](https://arxiv.org/abs/2411.18872). 

- **notes**: In addition to the formal proofs, the dataset includes a decomposition of these proofs into 1,329 lemmas, totaling over 40,000 lines of Lean code. These lemmas serve as building blocks for the formal proofs, offering approachable challenges for AI models and facilitating the evaluation and diagnosis of their performance in automated theorem proving. 

- **tags**: "human", "compilation", "theorem proving", "Lean", "mathematics"

This card provides a comprehensive overview of the IMO-Steps dataset, highlighting its structure, content, and significance in advancing research in formal mathematics and automated theorem proving. 